{
	"@metadata": {
		"authors": [
			"EugeneZelenko",
			"Fryed-peach",
			"Purodha",
			"Siebrand",
			"Umherirrender",
			"Ajeje Brazorf"
		]
	},
	"usergifts-desc": "{{desc|name=UserGifts|url=https://www.mediawiki.org/wiki/Extension:SocialProfile}}",
	"giftmanager": "Title of Special:GiftManager, the special page which allows privileged users—and, if configured so, regular users as well—to create and edit user-to-user gifts",
	"giftmanager-addgift": "Link text on Special:GiftManager; clicking on this link takes you to the form for adding a new gift",
	"giftmanager-access": "Access can either be public (a gift that shows up on Special:GiveGift and that everyone can give out) or private (a gift that won't show up on Special:GiveGift and that only its creator can give out). See {{msg-mw|giftmanager-public}}/{{msg-mw|giftmanager-private}} for more info.",
	"giftmanager-description": "A brief description of the gift, i.e. what it represents and such.",
	"giftmanager-giftimage": "Used on Special:GiftManager; all gifts can and should have a small image associated with them; the image represents the gift object (e.g. a cookie, a medal, etc.)",
	"giftmanager-image": "Link text; clicking on the link takes you to Special:GiftManagerLogo, the special page for uploading a new image for the gift that you're modifying",
	"giftmanager-giftcreated": "Success message shown after creating a new gift via Special:GiftManager",
	"giftmanager-giftsaved": "Success message shown after editing an existing gift via Special:GiftManager",
	"giftmanager-public": "Gift visibility, shown on Special:GiftManager\nBy default all gifts are public; when the configuration variable <code>$wgMaxCustomUserGiftCount</code> is set to a value higher than zero in the wiki's [[mw:Manual:LocalSettings.php|LocalSettings.php]] file, users can create private gifts (gifts that only they can give out and which won't show up on the main Special:GiveGift page). Furthermore, if the user does '''not''' have the <code>giftmanager</code> user right, they can ''only'' create private gifts (again, assuming that <code>$wgMaxCustomUserGiftCount</code> is set to a value higher than zero).\n{{Identical|Public}}",
	"giftmanager-private": "Gift visibility, shown on Special:GiftManager\nBy default all gifts are public; when the configuration variable <code>$wgMaxCustomUserGiftCount</code> is set to a value higher than zero in the wiki's [[mw:Manual:LocalSettings.php|LocalSettings.php]] file, users can create private gifts (gifts that only they can give out and which won't show up on the main Special:GiveGift page). Furthermore, if the user does '''not''' have the <code>giftmanager</code> user right, they can ''only'' create private gifts (again, assuming that <code>$wgMaxCustomUserGiftCount</code> is set to a value higher than zero).\n{{Identical|Private}}",
	"giftmanager-view": "Link text, shown on the form when editing an existing gift or adding a new one; clicking on this link takes you back to the Special:GiftManager main view, which lists all currently existing gifts",
	"g-add-message": "Used on Special:GiveGift, followed by a textarea element that the user can use to pass a custom message to the user whom they're gifting, e.g. \"For your hard work on last week's featured article!\", etc.",
	"g-characters-left": "Used on Special:GiveGift to visually indicate to users who have JavaScript enabled the amount of characters available for the custom message, which can be no longer than 255 characters. Because this countdown uses JavaScript, it is not shown to users who have JavaScript disabled. Regardless, validation is done server-side so nobody is able to try to send a message longer than 255 characters.\nParameters:\n* $1 is a HTML <code>&lt;span&gt;</code> element, '''not''' a number! This element's value is dynamically calculated at runtime by JavaScript (in <code>/extensions/SocialProfile/UserGifts/resources/js/UserGifts.js</code>), and hence it's not a number we can use for PLURAL etc.; thus PLURAL is not available for this message. See also {{msg-mw|fanbox-charsleft}}.",
	"g-back-edit-gift": "Used on Special:GiftManagerLogo as a link title; clicking on this link takes you back to the main gift editor page, Special:GiftManager, so that you can edit the name, description, etc. of a certain, specified gift",
	"g-back-gift-list": "Used on Special:GiftManagerLogo as a link title; clicking on this link takes you back to the main gift editor page, Special:GiftManager, which displays the list of all available gifts",
	"g-back-link": "Used in various places (Special:GiftManager, Special:GiveGift, Special:ViewGift, Special:ViewGifts, Special:RemoveGift) as a \"back\" link.\n$1 is the user name, e.g. the user whose gift you're viewing (Special:ViewGift, Special:ViewGifts) or the user whom you want to give a gift (Special:GiveGift) or the user who created a particular gift (Special:GiftManager)",
	"g-choose-file": "Used on Special:GiftManagerLogo, the special page for uploading new gift images; this is followed by the input box and button which allow you to overwrite the current gift image with a new one.",
	"g-count": "* '''$1''' is a user name\n* '''$2''' is his or her count of gifts",
	"g-create-gift": "Button text on Special:GiftManager when you're creating a brand new gift",
	"g-created-by": "Complete contents of a cell in a table. The next cell (horizontally) contains the user name of the creator of a gift. {{gender}}\n* (optional) $1 is a user name that is used in the next cell",
	"g-current-image": "Field label/table cell element on Special:GiftManager",
	"g-delete-message": "Confirmation message on Special:RemoveGift to make sure the user knows that they're about to perform an action that results in data loss and cannot be undone.\n$1 is the name of the gift they are about to delete.",
	"g-description-title": "Page title of Special:ViewGift, the special page for viewing details about an individual user's individual gift.\n{{gender}}\n* $1 is a user name\n* $2 is the name of a gift",
	"g-error-do-not-own": "Error message shown when attempting to delete someone else's gift",
	"g-error-message-blocked": "Error message shown on Special:GiveGift when a blocked user attempts to use that special page",
	"g-error-message-invalid-link": "Generic error message shown by various UserGifts special pages, usually means that either the <code>gift_id</code> parameter is missing from the URL or it is present but invalid (not a number; gift IDs are always supposed to be numbers).",
	"g-error-message-login": "Error message shown on Special:GiveGift when an anoymous user attempts to use that special page",
	"g-error-message-no-user": "Error message shown by various UserGifts special pages when the user attempts to perform actions like sending a gift to a user that does not exist",
	"g-error-message-to-yourself": "Error message shown on Special:GiveGift when the user attempts to give a gift to themselves",
	"g-error-title": "Error page title",
	"g-file-instructions": "Instructions on Special:GiftManagerLogo as to what kind of images are acceptable as gift images.",
	"g-from": "Shown on Special:ViewGift, Special:ViewGifts and Special:RemoveGift.\n$1 is the user name of the person who sent the gift that you're either viewing or trying to remove",
	"g-gift": "Gift image <code>alt</code> attribute",
	"g-gift-name": "Field label/table cell element on Special:GiftManager",
	"g-give-gift": "Button text on Special:GiveGift",
	"g-give-all": "Instructions shown on Special:GiveGift explaining how to use the special page.\n$1 is the user name of the person whom you're sending a gift",
	"g-give-all-message-title": "Shown on Special:GiveGift when in the process of gifting a named user; this message is followed by a textarea element that the user can use to send the recipient a personalized message together with the gift (e.g. \"For all your hard work on character articles!\", \"Thank you for helping me write last week's featured article\", etc.).",
	"g-give-all-title": "Page title of Special:GiveGift when in the process of gifting a named user; $1 is the user name of the person you're about to send a gift",
	"g-give-enter-friend-title": "Instructions shown on Special:GiveGift; this is preceded by the drop-down menu containing the users' friends (if any) and followed by a n input box, to which the user can enter the user name of the recipient or a part of the user name and the software will suggest possible matches using the same logic as many core MediaWiki special pages do.",
	"g-given": "Shown on Special:ViewGift, indicating how many times the gift in question has been given out.\n$1 is the amount of times the gift has been given out",
	"g-give-list-friends-title": "Shown on Special:GiveGift if you have friends; this is displayed above the drop-down menu, which contains your friends' user names",
	"g-give-separator": "{{Identical|Or}}",
	"g-give-no-user-message": "Message shown on Special:GiveGift; this message tells a bit about what gifts are and when they should be used. Sites may choose to customize this to link to local gifting policy or somesuch if they so desire.",
	"g-give-no-user-title": "Message shown on Special:GiveGift when no gift recipient has yet been specified",
	"g-give-to-user-title": "Page title of Special:GiveGift when sending a gift.\nParameters:\n* $1 is the gift name\n* $2 is the recipient's user name",
	"g-give-to-user-message": "Message shown on Special:GiveGift when sending a user a certain gift (e.g. the URL contain <code>gift_id</code> parameter). This message informs the user that there (probably) are other gifts they can also send to the recipient if for some reason the current gift is not one they wish to send.\n$1 is the user name of the person you're giving a gift to",
	"g-give-this-gift": "Shown on Special:GiveGift on each gift box when the user has JavaScript disabled; checking the box labeled with this message allows the user to give the desired gift to the target user even when JavaScript is disabled.",
	"g-go-back": "{{Identical|Go back}}",
	"g-imagesbelow": "Success message shown on Special:GiftManagerLogo after uploading a (new) gift image for a gift",
	"g-large": "{{Identical|Large}}",
	"g-list-title": "Page title of Special:ViewGifts\n$1 is the user name of the person whose gift list you're viewing",
	"g-medium": "{{Identical|Medium}}",
	"g-mediumlarge": "Medium-large gift images are, like other medium-large images in [[mw:Extension:SocialProfile|SocialProfile]] and other [[mw:social tools|social tools]], 50 pixels by 50 pixels.",
	"g-new": "{{Identical|New}}",
	"g-next": "{{Identical|Next}}",
	"g-previous": "{{Identical|Prev}}",
	"g-remove": "Button text on Special:RemoveGift and Special:RemoveMasterGift, allowing a user to either remove a gift from themselves (Special:RemoveGift) or from all users (Special:RemoveMasterGift), provided they have the sufficient user rights to perform the latter action\n\n{{Identical|Remove}}",
	"g-remove-gift": "Link text of a link shown on Special:ViewGift and Special:ViewGifts; clicking on the link takes the user to the page which allows them to remove the gift in question",
	"g-remove-message": "Confirmation message shown to the user on Special:RemoveGift and Special:RemoveMasterGift when they're about to remove a gift\n$1 is the name of the gift to be removed",
	"g-recent-recipients": "Used on Special:ViewGift; below this text are the small avatars of some other users who've gotten this same gift recently",
	"g-remove-success-title": "Page title of Special:RemoveGift and Special:RemoveMasterGift after successfully removing a gift.\n$1 is the name of the gift you removed",
	"g-remove-success-message": "Informational message shown on Special:RemoveGift and Special:RemoveMasterGift after removing a gift successfully.\n$1 is the name of the gift you removed",
	"g-remove-title": "Page title of Special:RemoveGift and Special:RemoveMasterGift when about to remove a gift\n$1 is the name of the gift you're about to remove",
	"g-send-gift": "Text of a button shown on Special:GiveGift; pressing the button sends the desired gift to the desired user",
	"g-select-gift": "Error message shown on Special:GiveGift if the user hasn't chosen a gift to send to another user but tries to submit the form nevertheless.",
	"g-select-a-friend": "Shown on Special:GiveGift if you have friends; this is the first item in the drop-down menu containing your friends' user names.",
	"g-sent-title": "Page title of Special:GiveGift after sending a gift to somebody.\n$1 is the user name of the person you just sent a gift to.",
	"g-sent-message": "Informational message shown on Special:GiveGift after sending a gift to somebody. This message is followed by the image and description of the gift you just sent as well as your personalized message to the recipient (if you specified such a message).\n$1 is the user name of the person you just sent a gift to.",
	"g-small": "{{Identical|Small}}",
	"g-to-another": "Link title, shown on Special:ViewGift and Special:ViewGifts; clicking on this link allows you to give a specified gift to another user.",
	"g-uploadsuccess": "Success message (header) shown on Special:GiftManagerLogo after uploading a (new) gift image",
	"g-viewgiftlist": "Link title, shown on Special:RemoveMasterGift; clicking on this link takes you to Special:GiftManager, the special page for listing and editing all currently existing gifts as well as adding new ones",
	"g-your-profile": "Used as a button text on Special:GiveGift and Special:RemoveGift, where this button is shown after performing the action (giving a user a gift or removing a gift you've received), and also used on the [[mw:Extension:Echo|Echo]] notifications as a label text",
	"gift_received_subject": "Title of the email that you'll get when someone sents you a new gift, provided you've enabled email notifications in Special:UpdateProfile or Special:Preferences.\nParameters:\n* $1 is the user name of the person who sent you a gift\n* $2 is the name of the gift they sent",
	"gift_received_body_html": "HTML version of the \"you were sent a gift\" email message; the regular version is {{msg-mw|gift_received_body}}.\nParameters:\n* $1 is a (real) user name\n* $2 is the giving user's name\n* $3 is the gift name",
	"gift_received_body": "Regular version of the \"you were sent a gift\" email message; the HTML version is {{msg-mw|gift_received_body_html}}.\nParameters:\n* $1 is a (real) user name\n* $2 is the giving user's name\n* $3 is the gift name\n* $4 is a link to the given gift\n* $5 is a link to the user preferences page",
	"echo-category-title-social-gift": "{{doc-echo-category-title|tooltip=echo-pref-tooltip-social-gift}}",
	"echo-pref-tooltip-social-gift": "{{doc-echo-pref-tooltip|title=echo-category-title-social-gift}}",
	"notification-social-gift-send-no-message": "[[mw:Extension:Echo|Echo]] notification title\nParameters:\n* $1 is the user name of the person who sent you a gift\n* $2 is the name of the gift you received",
	"notification-social-gift-send-with-message": "[[mw:Extension:Echo|Echo]] notification title\nParameters:\n* $1 is the user name of the person who sent you a gift\n* $2 is the name of the gift you received\n* $3 is the personalized message from the user who sent you the gift",
	"notification-social-gift-send-bundle": "[[mw:Extension:Echo|Echo]] notification when multiple users have sent you gifts.\n$1 is the amount of users who sent you gifts.",
	"right-giftadmin": "{{doc-right|giftadmin}}",
	"action-giftadmin": "{{notranslate}}\nThis is literally never used anywhere, but I think this message exists so that [[mw:Continuous Integration|CI]] doesn't get upset (though ironically enough as of late February 2020 CI is broken anyway due to other reasons). Don't bother translating this.\n{{doc-action|giftadmin}}"
}
